Table of Contents
 Class MaterialStrengthProperty
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Class defines the strength of material acc. to materieal thickness
[OpenModelClass("IdeaRS.MprlModel.Material.MaterialStrengthProperty,CI.BasicTypes")]
public class MaterialStrengthProperty : OpenObject
Inheritance
object
OpenObject
MaterialStrengthProperty
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 List
Collection of material strength levels
public List<MaterialStrength> List { get; set; }
Property Value
List<MaterialStrength>
 Edit this page